In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt
import plotly.graph_objs as go
import os

In [3]:
os.listdir()

['Employee_Information.csv',
 'Student_Counceling_Information.csv',
 'Untitled.ipynb',
 '.ipynb_checkpoints',
 'Department_Information.csv',
 'Student_Performance_Data.csv']

In [14]:
emp_df = pd.read_csv('Employee_Information.csv')
perf_df = pd.read_csv('Student_Performance_Data.csv')
dpt_df = pd.read_csv('Department_Information.csv')
student_df = pd.read_csv('Student_Counceling_Information.csv')

In [64]:
student_df.describe(include='all')

,Student_ID,DOA,DOB,Department_Choices,Department_Admission
count,3819,3819,3819,3819,3819
unique,3819,6,1798,40,40
top,SID20137844,2015-07-01T00:00:00Z,2000-08-19T00:00:00Z,IDEPT3115,IDEPT3115
freq,1,660,8,113,113

In [40]:
student_df.drop_duplicates(subset='Student_ID',inplace=True)

In [41]:
student_df.duplicated(subset='Student_ID').sum()

0

In [30]:
perf_df.describe()

               Marks
count  209611.000000
mean       69.589573
std        18.098626
min        19.000000
25%        54.000000
50%        70.000000
75%        85.000000
max       100.000000

In [32]:
emp_df.describe()

       Employee ID                   DOB                   DOJ Department_ID
count         1000                  1000                  1000          1000
unique         998                   936                   919            34
top       IU444477  1992-10-02T00:00:00Z  2001-09-18T00:00:00Z     IDEPT5109
freq             2                     3                     3            42

In [44]:
emp_df.isna().any()

Employee ID      False
DOB              False
DOJ              False
Department_ID    False
dtype: bool

In [47]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Employee ID    1000 non-null   object
 1   DOB            1000 non-null   object
 2   DOJ            1000 non-null   object
 3   Department_ID  1000 non-null   object
dtypes: object(4)
memory usage: 31.4+ KB

In [82]:
def Born(x):
    return x.split('-')[0]
def Joined(x):
    return x.split('-')[0]

In [83]:
emp_df['Born'] = emp_df['DOB'].apply(Born)
emp_df['Joined'] = emp_df['DOJ'].apply(Joined)

In [88]:
emp_df = emp_df.drop(['DOB','DOJ'],axis=1)

In [89]:
emp_df.head()

  Employee ID Department_ID  Born Joined
0    IU196557     IDEPT4938  1983   2009
1    IU449901     IDEPT2357  1985   2009
2    IU206427     IDEPT4670  1971   2008
3    IU688905     IDEPT2601  1973   2002
4    IU634582     IDEPT7626  1991   2000

In [49]:
emp_df.duplicated(subset='Employee ID').any()

True

In [50]:
emp_df.drop_duplicates(subset='Employee ID',inplace=True)

In [51]:
emp_df.duplicated(subset='Employee ID').any()

False

In [90]:
emp_df.head()

  Employee ID Department_ID  Born Joined
0    IU196557     IDEPT4938  1983   2009
1    IU449901     IDEPT2357  1985   2009
2    IU206427     IDEPT4670  1971   2008
3    IU688905     IDEPT2601  1973   2002
4    IU634582     IDEPT7626  1991   2000

In [91]:
perf_df.head()

    Student_ID Semster_Name     Paper_ID Paper_Name  Marks
0  SID20131143        Sem_1  SEMI0012995    Paper 1     44
1  SID20131143        Sem_1  SEMI0015183    Paper 2     74
2  SID20131143        Sem_1  SEMI0018371    Paper 3     80
3  SID20131143        Sem_1  SEMI0015910    Paper 4     44
4  SID20131143        Sem_1  SEMI0016208    Paper 5     95

In [92]:
student_df.head()

,Student_ID,DOA,DOB,Department_Choices,Department_Admission
0,SID20131143,2013-07-01T00:00:00Z,1996-02-05T00:00:00Z,IDEPT7783,IDEPT7783
1,SID20131151,2013-07-01T00:00:00Z,1995-07-31T00:00:00Z,IDEPT6347,IDEPT6347
2,SID20131171,2013-07-01T00:00:00Z,1995-09-05T00:00:00Z,IDEPT1836,IDEPT1836
3,SID20131176,2013-07-01T00:00:00Z,1996-01-12T00:00:00Z,IDEPT8473,IDEPT8473
4,SID20131177,2013-07-01T00:00:00Z,1995-07-30T00:00:00Z,IDEPT5528,IDEPT5528

In [93]:
def Admitted(x):
    return x.split('-')[0]
def Born(x):
    return x.split('-')[0]

In [96]:
student_df['Admitted'] = student_df['DOA'].apply(Admitted)
student_df['Born'] = student_df['DOB'].apply(Born)

In [97]:
student_df = student_df.drop(['DOA','DOB'],axis=1)

In [57]:
dpt_df.head()

  Department_ID                 Department_Name                   DOE
0     IDEPT4670           Aerospace Engineering  1961-05-31T00:00:00Z
1     IDEPT5528  Biosciences and Bioengineering  1943-06-28T00:00:00Z
2     IDEPT3115            Chemical Engineering  1940-05-01T00:00:00Z
3     IDEPT5881                       Chemistry  2013-06-08T00:00:00Z
4     IDEPT4938               Civil Engineering  1941-10-27T00:00:00Z